#1) შექმენით ფუნქცია სახელად greet რომელსაც ექნება ერთი პარამეტრი სახელად name, ფუნქცია უნდა დაბეჭდოს Hello და გადმოცემული სახელი (მოიძიეთ ინფორმაცია არგუმენეტბისა და პარამეტრების შესახებ ინტერნეტში, კომენტარებით ახსენით რა არის ფუნქცია, პარამეტრი და არგუმენტი აგრეთვე რატომ უნდა გამოვიყენოთ ფუნქციები)



# ფუნქციის შექმნა სახელად greet
# "name" არის პარამეტრი — ანუ ცვლადი, რომელიც ფუნქციაში შევა
def greet(name):                   # ფუნქცია სახელად greet, რომელსაც აქვს ერთი პარამეტრი name
    print("Hello", name)           # ბეჭდავს Hello და გადმოცემულ სახელს

greet("Enriko")                    # ფუნქციის გამოძახება, სადაც "Enriko" არის არგუმენტი
