#3) შექმენით ფუნქცია სახელად add რომელიც აკეთებს შეკრებას და აბრუნებს ჯამს, შემდეგ შექმენით ფუნქცია რომელიც ამრავლებს რიცხვებს და აბრუნებს ნამრავლს (სახელი multiply), შემდეგ შექმენით ფუნქციების გარეთ ცვლადი სახელად result რომელშიც შეინახავთ ორივე ფუნქციის გამოძახების დაბრუნებული შედეგების ჯამს, საბოლოოდ კი დაბეჭდავთ


def add(num1, num2):   # ფუნქცია რომელიც ორ რიცხვს ამატებს
    return num1 + num2   # აბრუნებს მათ ჯამს

def multiply(num1, num2):   # ფუნქცია რომელიც ორ რიცხვს ამრავლებს
    return num1 * num2   # აბრუნებს მათ ნამრავლს

result = add(5, 3) + multiply(4,2)   # result ცვლადში ვინახავთ ორივე ფუნქციის დაბრუნებული შედეგების ჯამს

print(result)  # ბეჭდავს საბოლოო შედეგს
    