#4) შექმენით ფუნქცია სახელად filter_evens, რომელსაც გადაეცემა ერთი რიცხვი, ფუნქციაში შექმენით ცვლადი სახელად number რომელიც არის ცარიელი მასივი, შემდეგ გამოიყენეთ for ციკლი იმისათის რომ 0 დან გადმოცემულ რიცხვის ჩათვლით ყველა რიცხვი შეამოწმოთ არის თუ არა ლუწი, თუ ლუწია დაამატეთ მასივში appends გამოყენებით, საბოლოოდ როცა მორჩბეა ციკლი მუშაობას დააბრუნეთ სია


def filter_evens(limit):                      # ფუნქცია რომელიც იღებს ერთ რიცხვს (limit)
    numbers = []                              # ცარიელი სია, სადაც ლუწი რიცხვები დაემატება

    for i in range(0, limit + 1):             # ციკლი 0-დან გადმოცემულ რიცხვამდე ჩათვლით
        if i % 2 == 0:                        # თუ რიცხვი ლუწია
            numbers.append(i)                 # დაამატე სიაში append-ის საშუალებით

    return numbers                            # დააბრუნე საბოლოო სია

print(filter_evens(10))                       # ფუნქციის გამოძახება არგუმენტით 10
