// 4) შექმენით ცვლადი სადაც შეინახავთ 1 - 10 - მდე random - რიცხვს (გამოიყენეთ Math ბიბლიოთეკა და მასზე შესაბამისი მეთოდი), შექმენით მეორე 
// ცვლადი სადაც შეინახავთ თქვენთვის სასურველ რიცხვს 1 - 10 - მდე, თქვენი დავალებაა, რომ შეამოწმოთ თუ თქვენს მიერ შემოტანილი რიცხვი უდრის 
// random რიცხვს გამოიტანეთ text - 'You have guessed the random number' სხვა შემთხვევაში კი 'You have not guessed the random number. Please 
// try again later'

// 5) შექმენით მასივი, სადაც შეინახავთ რიცხვებს, თქვენი დავალებაა, რომ თქვენით დაწეროთ ამ მასივში არსებული რიცხვების საბოლოო ჯამის 
// გამოსათვლელი ლოგიკა

// 6) შექმენით სახელების მასივი, თქვენი დავალებაა, რომ ამ მასივს გადაუაროთ და გამოიტანოთ თითო ელემენტი

// 7) მოიძიეთ დამატებითი ინფორმაცია მასივის მეთოდების შესახებ, და თითოეულზე გააკეთეთ 2-2 მაგალითი

// 8) კომენტარების სახით ახსენით იქნება თუ არა მოცემულ კოდში შეცდომა

// console.log(1090 + 'Nino')

// 9) შექმენით მასივი სადაც შეინახავთ სახელებს, თქვენი დავალებაა, რომ შეამოწმოთ მოიცავთ თუ არა თქვენი მასივი თქვენს სახელს, თუ კი გამოიტანეთ, 
// რომ name is in the array, სხვა შემთხვევაში კი name is not in the array, გამოიყენეთ შესაბამისი მეთოდი

// 10) შექმენით ორი ცვლადი რომელშიც შეინახავთ რიცხვებს, თქვენი დავალებაა, რომ შეამოწმოთ თუ პირველი რიცხვი მეორეზე მეტია გამოიტანეთ 'The first 
// number is greater than the second number' თუ მეორე რიცხვი პირველ რიცხვზე მეტია გამოიტანეთ 'The second number is greater than the first 
// number' სხვა შემთხვევაში კი გამოიტანეთ 'The numbers are equal to each other'

const numbers = Math.floor(Math.random() * 10) + 1

let myNum = 6

if(myNum === numbers) {
    console.log('You have guessed the random number');
} else {
    console.log('You have not guessed the random number. Please try again later')
}

console.log(myNum)