#1) შექმენით ფუნქცია სახელად is_even რომელიც იღებს ერთ არგუმენტს number, თქვენი დავალებაა რომ შეამოწმოთ არის თუ არა გადმოცემული რიცხვი ლუწი თუ კი მაშინ დააბრუნეთ True სხვა შემთხვევაში კი False, გამოიძახეთ ფუნქცია 5 ჯერ განსხვავებული არგუმენტებით





def is_even(number):  # ფუნქცია იღებს ერთ რიცხვს
    if number % 2 == 0:  # თუ 2-ზე გაყოფის ნაშთი 0-ია, ანუ ლუწია
        return True
    else:
        return False

# ფუნქციის გამოძახება 5 სხვადასხვა რიცხვით
print(is_even(2))
print(is_even(3))
print(is_even(10))
print(is_even(17))
print(is_even(0))
