#2) გამოიყენეთ while ციკლი (მოიძიეთ) და მომხმარებელს იქამდე შემოატანინეთ პროდუქტები სანამ არ შემოიტანს სიტყვა exit, 
# ყველა შემოტანიული პროდუქტი უნდა ემატებოდეს სიაში (მოიძიეთ list ების შესახებ ინფორმაცია)




#Python-ში List (სია) არის მონაცემების კრებული, რომელიც ერთ ცვლადში ინახავს რამდენიმე მნიშვნელობას.



products = []  

product = ""  

while product != "exit":  
    product = input("შეიყვანე პროდუქტი (ჩაწერე 'exit' გასასვლელად): ")
    if product != "exit":
        products.append(product)  

print("შენი პროდუქტებია:", products)  
