// SCOPE — არის ის სივრცე/ზონა, სადაც ცვლადი ხელმისაწვდომია.
// 3 ტიპი არსებობს:

// 1) Global scope — ხელმისაწვდომია ყველგან
let x = 10;   

// 2) Block scope -> let და const ქმნიან ბლოკურ ცვლადებს
if (true) {
  let i = 30;
  console.log(i); // 30
}


// რატომ არის var ცუდი პრაქტიკა
// var არ ქმნის block scope-ს და შეიძლება შეცდეს

if (true) {
  var bad = 50;
}

console.log(bad); 
// 50 — მუშაობს, რადგან var ბლოკს არ ითვალისწინებს.
// სწორედ ამიტომ var იწვევს დაბნეულობას და ბაგებს.
// ამიტომ ყოველთვის იყენებენ: let და const
